tap "cirruslabs/cli"
tap "hashicorp/tap"
brew "gettext"
brew "glib"
brew "pixman"
brew "python@3.14"
brew "tree"
brew "ansible"
brew "antiword"
brew "awk"
brew "bash"
brew "bash-completion@2"
brew "node"
brew "bash-language-server"
brew "bat"
brew "bazelisk"
brew "cmake"
brew "lima"
brew "colima"
brew "coreutils"
brew "cosign"
brew "cue"
brew "pkgconf"
brew "czkawka"
brew "devcontainer"
brew "diffutils"
brew "direnv"
brew "dockerfile-language-server"
brew "gnutls"
brew "emacs"
brew "exiftool"
brew "fd"
brew "fdupes"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gemini-cli"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-filter-repo"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "gpatch"
brew "graphviz"
brew "grep"
brew "jdupes"
brew "jq"
brew "libgsf"
brew "libslirp"
brew "mage"
brew "make"
brew "meson"
brew "protobuf"
brew "mosh"
brew "nmap"
brew "pandoc"
brew "patchutils", link: false
brew "pipx"
brew "podman"
brew "podman-compose"
brew "poppler"
brew "python@3.12"
brew "qemu"
brew "rclone"
brew "ripgrep"
brew "rmlint"
brew "rpm"
brew "rsync"
brew "rust"
brew "rust-analyzer"
brew "samba"
brew "sevenzip"
brew "shellcheck"
brew "skopeo"
brew "sleuthkit"
brew "stow"
brew "tmux"
brew "typst"
brew "vim"
brew "wget"
brew "yaml-language-server"
brew "yamlfmt"
brew "yamllint"
brew "yq"
brew "cirruslabs/cli/tart"
cask "alacritty"
cask "alt-tab"
cask "ditto"
cask "emacs-app"
cask "hashicorp/tap/hashicorp-vagrant"
cask "iterm2@beta"
cask "maccy"
cask "markdown-service-tools"
cask "meld"
vscode "anysphere.remote-containers"
vscode "anysphere.remote-ssh"
vscode "golang.go"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.makefile-tools"
vscode "myriad-dreamin.tinymist"
vscode "redhat.vscode-yaml"
vscode "zxh404.vscode-proto3"
go "github.com/spf13/cobra-cli"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "github.com/swiss-software-tool/sst/cmd/hetzner-plugin"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "github.com/swiss-software-tool/sst/cmd/sst"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/u-root/u-root"
