git
ripgrep
fd-find
fzf
tmux
golang
nodejs
npm
python3
python3-pip
shellcheck
yamllint
jq
direnv
cmake
pkg-config
bazel
docker.io
docker-compose
graphviz
emacs-nox
rpmlint
lintian
rpm
