
# Emacs (CLI) – use emacs-plus on mac if you want GUI
brew "bash-completion@2"
brew "bash"
brew "bazelisk"
brew "cmake"
brew "colima"
brew "coreutils"
brew "devcontainer"
brew "direnv"
brew "docker-compose"
brew "docker"
brew "emacs"
brew "fd"
brew "fdupes"
brew "findutils"
brew "fzf"
brew "git-filter-repo"
brew "git"
brew "gnu-sed"
brew "go"
brew "golangci-lint"
brew "gpatch"
brew "graphviz"
brew "grep"
brew "jq"
brew "lintian"    # available via brew nowadays
brew "make"
brew "node"
brew "patchutils", link: false
brew "pkg-config"
brew "podman" # optional
brew "protobuf"
brew "python@3.12"
brew "ripgrep"
brew "rpm"        # gives rpmlint via brew 'rpmlint' (or use 'brew install rpmlint' directly)
brew "rpmlint"    # if available in your tap set
brew "shellcheck"
brew "tmux"
brew "tree"
brew "yamllint"
brew "yq"
cask "iterm2"
cask "maccy"
tap "homebrew/cask-fonts"
tap "homebrew/cask"
vscode "anysphere.remote-containers"
vscode "anysphere.remote-ssh"
vscode "golang.go"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.makefile-tools"
